Repository: hsugawa8651/juliadoc-trans-ja
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Values can be converted to Float32 easily:
ja: 値を`Float32'に変換することは容易にできます。

source: Values can be converted to `Float32` easily:
ja: 値は簡単に `Float32` に変換することが可能です。:

source: Values can be specified as any iterable object, but will commonly be ranges like 1:n or 2:(n-1), or explicit arrays of values like [1.2, 3.4, 5.7].
ja: 値は、任意のオブジェクトとして指定することができますが は一般的に1:nまたは2:(n-1)、または[1.2、3.4、5.7]のような明示的な値の配列である。

source: Values which cannot be stored in UInt128 cannot be written as such literals.
ja: UInt128に格納できない値は、そのようなリテラルとは書くことができません。

source: Variable names are case-sensitive, and have no semantic meaning (that is, the language will not treat variables differently based on their names).
ja: 変数名は大文字と小文字が区別され、言語的な意味を持ちません。

source: Variable names must begin with a letter (A-Z or a-z), underscore, or a subset of Unicode code points greater than 00A0; in particular, Unicode character categories Lu/Ll/Lt/Lm/Lo/Nl (letters), Sc/So (currency and other symbols), and a few other letter-like characters (e.g. a subset of the Sm math symbols) are allowed.
ja: 変数名は、文字（AからZまたはaからz）、アンダースコア、もしくは00A0よりも大きなUnicodeの サブセットの符号点である必要があります。特に、Unicode文字カテゴリ のLu/Ll/Lt/Lm/Lo/Nl （文字）、 Sc/So（通貨とその他の記号）、その他の記号（Sm数学記号のサブセットなど）を使用することができます。 ！や数字（0から9とNd･Noカテゴリ内のその他の記号）、その他のUnicode符号点 （発音区別符号およびその他の修飾文字（Mn/Mc/Me/Skカテゴリ）、句読点コネクタ（Pcカテゴリ）、 プライム記号、その他の文字）を使用することができます。

source: Various types of iterable containers will be introduced and discussed in later sections of the manual (see, e.g., (@ref man-multi-dim-arrays)).
ja: 次のセクションでは、さまざまなタイプの定義可能なコンテナが導入され、議論されています。 マニュアル(例えば、(@ref man multi dim arrays))を参照してください。

source: Various types of iterable containers will be introduced and discussed in later sections of the manual (see, e.g., Multi-dimensional Arrays).
ja: さまざまなタイプのイテラブル・コンテナについて、マニュアルの後ろの章で紹介・検討します（多次元配列参照）。

source: Vectors and multidimensional arrays of integers
ja: 整数のベクトルおよび多次元配列

source: Very few operations are implemented specifically for Array beyond those that are required for all AbstractArrays; much of the array library is implemented in a generic manner that allows all custom arrays to behave similarly.
ja: アレイに対しては、必要な動作を超えて実装されているオペレーションはほとんどありません。 すべてのAbstractArray;アレイライブラリの多くは一般的に実装されています。 すべてのカスタム・アレイが同じように動作するようにする方法です。

source: Warning: do not implement these methods if the underlying storage is not actually strided, as it may lead to incorrect results or segmentation faults.
ja: 警告:基礎となるストレージが実際にはストライドされていない場合は、これらのメソッドを実装しないでください。 誤った結果やセグメント化の障害につながる可能性があります。

source: We also know the number of elements in our sequence, so we can extend `length`, too:
ja: また、シーケンス内のエレメント数も知っています。 の長さを拡張することもできます。

source: We believe there are many good reasons to prefer dynamic languages for these applications, and we do not expect their use to diminish.
ja: 私達はこの分野で動的言語を用いることにたくさんの利点があることを理解していますし、動的言語が使われないようにしたいわけでもありません。

source: We can expose this as an indexing expression S[i].
ja: これは、インデックス表現S[i]として公開することができます。

source: We can iterate over all the elements:
ja: すべての要素を繰り返し処理することができます。

source: We can use many of the builtin methods that work with iterables, like `in`, or `mean` and `std` from the Statistics standard library module:
ja: iterablesで動作する組み込みメソッドの多くを使うことができます。 の、<x/>、、、'のように 統計情報標準ライブラリモジュール:

source: We can verify that this constructor works and constructs objects that are, in fact, self-referential:
ja: このコンストラクタが動作し、実際には自己参照であるオブジェクトを構成していることを確認できます。

source: We have already seen a function f(::Expr...) -> Expr in a previous section.
ja: 私達は、前の説で、関数f(::Expr...) -> Exprを見てきました。

source: We have already seen one example of a function returning Expr
ja: 私たちはすでに、Exprを返す関数の一例を見てきました。

source: We know that the elements in a Squares sequence will always be Int.
ja: 2乗の配列内の要素は常にIntであることがわかる。

source: We should mention here that this is far from a complete picture of defining functions.
ja: ここでは、関数を定義する完全な全体像とは程遠いことを説明しておきましょう。

source: What happens if import Zebra is evaluated in the main App code base?
ja: メインAppのコードベースで、Zebraのインポートが評価された場合はどうなりますか?

source: What's really going on here is that Point, Point{Float64} and Point{Int64} are all different constructor functions.
ja: ここでは、点、点{Float64}および点{Int64}がすべて異なっていることを示している。 コンストラクタ関数。

source: What package is X in this context?
ja: この文脈ではパッケージはXであるか?

source: When Julia encounters import X in the main project, it looks up the identity of X as roots[:X].
ja: Juliaが主プロジェクトでXのインポートXを検出すると、Xのアイデンティティをの根[:X]として検索します。

source: When Julia sees import X in the code of the package whose UUID is context, it looks up the identity of X as graph[context][:X].
ja: そのUUIDがのコンテキストであるパッケージのコードで、JuliaがxインポートXを見ると、Xのアイデンティティをグラフ[コンテキスト][x16/>]として検索します。

source: When a file is run as the main script using julia file.jl one might want to activate extra functionality like command line argument handling.
ja: juliaファイルを使用して、ファイルがメイン・スクリプトとして実行される場合、juliaファイル.jlを使用して追加のファイルをアクティブ化する必要があります コマンドライン引数の処理などの機能です。

source: When a function is applied to a particular tuple of arguments, the most specific method applicable to those arguments is applied.
ja: 関数が特定の引数の組に適用されるとき、それらの引数に適用可能なものから最も特化したメソッドが適用されます。

source: When a scalar value is passed with & as an argument of type Ptr{T}, the value will first be converted to type T.
ja: Ptr{T}の引数として&とスカラー値を渡すと、まず値が次のようになります。 Tに変換されます。

source: When an array is passed to C as a Ptr{T} argument, it is not reinterpret-cast: Julia requires that the element type of the array matches T, and the address of the first element is passed.
ja: 配列がPtr{T}引数としてCに渡されるとき、キャストは再解釈されません:Juliaが必要とする 配列のエレメント・タイプがTと一致し、最初のエレメントのアドレスが渡されます。

source: When an unexpected condition occurs, a function may be unable to return a reasonable value to its caller.
ja: 予期しない状態が発生した場合、関数は妥当な値を返すことができません。 その呼び出し元。

source: When both libraries and executables are generated by LLVM, it is possible to perform whole-program optimizations that can even optimize across this boundary, but Julia does not yet support that.
ja: 両方 ライブラリと実行可能ファイルはLLVMによって生成されるため、プログラム全体の最適化を実行することができます。 この境界にわたって最適化することもできますが、ジュリアはまだサポートしていません。

source: When chaining conditionals (including if/elseif/end), the @static must be repeated for each level (parentheses optional, but recommended for readability):
ja: //の場合は、@staticを繰り返す必要があります。<x x/>は 各レベル(オプションではありますが、読みやすさには推奨されます):

source: When combined with other indexing forms and iterators that yield CartesianIndexes, however, this can produce very elegant and efficient code.
ja: 他のインデックス作成フォームおよびイテレータと組み合わされた場合 しかし、それはCartesianIndexの収量をもたらすが、これは非常にエレガントなものである。 効率的なコードです。

source: When dealing with platform libraries, it is often necessary to provide special cases for various platforms.
ja: クロスプラットフォームアプリケーションやライブラリを記述する場合は、 オペレーティング・システム間の違いを許す必要があります。

source: When defining a function, one can optionally constrain the types of parameters it is applicable to, using the :: type-assertion operator, introduced in the section on Composite Types:
ja: 関数を定義するときには、必要に応じて、 複合型に関するセクションで紹介した::型表明演算子を使って、適用可能なパラメータの型を、制限することができます：

source: When mirroring a struct used by-value inside another struct in C, it is imperative that you do not attempt to manually copy the fields over, as this will not preserve the correct field alignment.
ja: Cの別の構造体内の値で使用される構造体をミラーリングする場合は、それは必須です。 フィールドを手動でコピーしないようにします。これは、正しいフィールドを保持しないためです。 フィールドの位置合わせ。

source: When one of the operands of ⊘
ja: θのオペランドの一つが

source: When passing data to a `ccall`, it is best to avoid using the `pointer` function.
ja: "ccall""にデータを渡す場合は、'ポインタ''関数を使用しないことをお勧めします。

source: When redefining a method or adding new methods, it is important to realize that these changes don't take effect immediately.
ja: メソッドの再定義や、新しいメソッドの追加は、その変更が即座に反映されない、という認識は重要です。

source: When resolving the meaning of import X, roots and graph are used to determine the identity of X and answer the question "what is `X`?", while the paths map is used to locate the source code of X and answer the question "where is `X`?" The specific roles of the three maps are:
ja: インポートXの意味を解決するとき、とグラフは、Xの識別を決定するために使用されます。は、のXと答えます。は、Xのソースコードを特定するために使用されます。は、X20/>のソースコードを検索し、質問<X21/>に答えます。

source: When run in interactive mode, julia displays a banner and prompts the user for input.
ja: インタラクティブ・モードで起動すると、 julia のバナーが表示され、プロンプトがユーザーの入力を待ちます。

source: When strings are created using triple-quotes ("""...""") they have some special behavior that can be useful for creating longer blocks of text.
ja: 文字列が3つのダブルクオーテーション("""...""") they have some special behavior that)を使用して作成される場合、長いテキストを作成するのに便利な 特殊な動作をします。

source: When such incompatibilities occur, you'll typically want to upgrade your dev tools to versions that are compatible with the main project.
ja: このような互換性がない場合は、通常は開発ツールをメインプロジェクトと互換性のあるバージョンにアップグレードする必要があります。

source: When the array is subsequently indexed with a multidimensional set of indices, the fallback getindex(A::AbstractArray, I...)()
ja: アレイが次に 索引の多次元集合でインデックスを作成します。フォールバックgetindex(A::AbstractArray, I...)()

source: When the current this object is the receiver of a method call, it can be omitted altogether, writing just meth(arg1,arg2), with this implied as the receiving object.
ja: this オブジェクトがメソッド呼び出しのレシーバである場合は省略できます。meth(arg1,arg2)と書くだけで、thisは受け取るオブジェクトを暗示します。

source: When the type is implied by the arguments to the constructor call, as in Point(1,2), then the types of the arguments must agree -- otherwise the T cannot be determined -- but any pair of real arguments with matching type may be given to the generic Point constructor.
ja: タイプが暗黙の場合 Point(1,2)のようにコンストラクタ呼び出しの引数によって、次のように入力されます。 引数は一致する必要があります。そうでない場合は、Tを指定できませんが、実数のペアはすべて指定されています。 一般的なPointコンストラクタには、一致するタイプの引数を指定することができます。

source: When this happens, modifying the code to handle non-ASCII data is straightforward.
ja: この場合、非ASCIIデータを処理できるように 修正することは簡単です。

source: When to use T, Ptr{T} and Ref{T}
ja: Tを使用する場合は、Ptr{T}およびRef{T}を使用します。

source: When translating your fields to Julia, declare the Julia field to be only of that type.
ja: フィールドをジュリアに変換するときは、次のように宣言します。 Juliaフィールドはそのタイプのみであることを示します。

source: When used as a function it has two possible forms, unary (single-argument) and binary.
ja: 使用する場合 関数は、単項(単一引数)とバイナリの2つの可能な形式を持つことができます。

source: When used recursively, isbits types are stored inline.
ja: 再帰的に使用される場合、イスビトスタイプはインラインに格納される。

source: When writing a generator expression with multiple dimensions inside an argument list, parentheses are needed to separate the generator from subsequent arguments:
ja: 引数リスト内に複数の次元を持つジェネレータ式を記述する場合は、括弧を使用します。 ジェネレータを次の引数から分離する必要があります。

source: When writing cross-platform applications or libraries, it is often necessary to allow for differences between operating systems.
ja: クロスプラットフォームアプリケーションやライブラリを記述する場合は、 オペレーティング・システム間の違いを許す必要があります。

source: When you created Priv, there was no public package by that name.
ja: Privを作成すると、その名前ではパブリックパッケージは作成されませんでした。

source: When you pass this Ref object as an argument, Julia will automatically pass a C pointer to the encapsulated data:
ja: このRefオブジェクトを渡すと 引数として、Juliaは自動的にCポインタをカプセル化されたデータに渡します。

source: When your broadcast operation involves several arguments, individual argument styles get combined to determine a single DestStyle that controls the type of the output container.
ja: ブロードキャスト操作に複数の引数が含まれる場合、個々の引数スタイルは次のようになります。 結合して、出力コンテナのタイプを制御する単一のDestStyleを決定します。

source: Whenever a free monoid is not commutative, the operation is typically represented as \cdot, *, or a similar symbol, rather than +, which as stated usually implies commutativity.
ja: 自由モノイドが非可換である時、連結演算子は、しばしば可換の状態であることを表す時に用いられる+よりも \cdot や * 、その他の類似した記号で表されることが多いです。

source: Whenever you have created a pointer to Julia data, you must ensure the original data exists until you are done with using the pointer.
ja: Juliaデータへのポインタを作成したときは必ず、元のデータが存在することを確認する必要があります。 ポインタを使用して終了します。

source: Whenever you subtype AbstractArrayStyle, you also need to define rules for combining dimensionalities, by creating a constructor for your style that takes a Val(N) argument.
ja: AbstractArrayStyleをサブタイプ化する場合は必ず、結合するルールを定義する必要があります。 Val(N)引数を取るスタイルのコンストラクタを作成することによって、次元性を実現します。

source: Where can that X package be found?
ja: はXパッケージが存在する可能性がある。

source: Whether these Unicode characters are displayed as escapes or shown as special characters depends on your terminal's locale settings and its support for Unicode.
ja: これらのUnicode文字がエスケープとして出力されるか特殊な文字として出力されるかは、あなたの端末のロケール設定とそのUnicodeのサポート の状況に依存します。

source: Which packages can "see" each other as dependencies depends on whether they contain project files, and if they do, on what appears in those project files' [deps] sections.
ja: 依存性として互いに「見える」パッケージは、プロジェクトファイルがプロジェクトファイルを含んでいるかどうかに依存しているか、それらがプロジェクトファイルの[deps]セクションに表示されるかによって異なります。

source: While * may seem like a surprising choice to users of languages that provide + for string concatenation, this use of * has precedent in mathematics, particularly in abstract algebra.
ja: + を文字列連結の記述としている言語の使用者にとっては Juliaが* をそれとするのは奇抜に見えるかもしれませんが、 この *の使われ方は数学、特に抽象代数学においては一般的です。

source: While Julia imposes few restrictions on valid names, it has become useful to adopt the following conventions:
ja: Juliaは有効な名前に制限をほとんど課していませんが、次の規則を採用すると便利です。

source: While outer constructor methods succeed in addressing the problem of providing additional convenience methods for constructing objects, they fail to address the other two use cases mentioned in the introduction of this chapter: enforcing invariants, and allowing construction of self-referential objects.
ja: 外部コンストラクタのメソッドは、追加の利便性を提供する問題に対処することに成功しています。 オブジェクトを構築するためのメソッドです。これらのメソッドは、次の2つのユースケースに対応しています。 この章の導入:インバリアントの適用、自己参照の可能化 オブジェクトを選択します。

source: While the casual programmer need not explicitly use types or multiple dispatch, they are the core unifying features of Julia: functions are defined on different combinations of argument types, and applied by dispatching to the most specific matching definition.
ja: カジュアルプログラマは型や多重ディスパッチを明示的に使う必要はありませんが、これらはJuliaの基礎となる機能です。 関数はさまざまな引数の組み合わせに対して定義され、実行時には最も当てはまる定義が適用されます。

source: While this behaviour is fixed for some compilers (GNU), others optionally permit placing hidden arguments directly after the character argument (Intel,PGI).
ja: この動作は、いくつかのコンパイラ(GNU)では修正されています。 他のオプションは、文字引数(インテル、PGI)の直後に、非表示の引数を直接配置することができます。

source: While this can be inconvenient when you are developing new code, there's an excellent workaround.
ja: これは、新しいコードを開発する際に不便な場合がありますが、優れた回避策があります。

source: While this is starting to support more of the (@ref man-array-indexing), there's still quite a number of behaviors missing.
ja: これは、(@ref man array indexing)のより多くのサポートを開始しています。 まだ多くの行動が失われています。

source: While we can rely upon generic implementations, we can also extend specific methods where we know there is a simpler algorithm.
ja: 一般的な実装に依存することもできますが、特定の方法を拡張することもできます。 より単純なアルゴリズムがあります。

source: While you are allowed to create objects with uninitialized fields, any access to an uninitialized reference is an immediate error:
ja: 初期化されていないフィールドを持つオブジェクトを作成することが許可されている間に、初期化されていないオブジェクトへのアクセス権がある 参照は即時エラーです。

source: With `start()` and `endof()`, can be used to iterate through the characters in str.
ja: `start()` や `endof()`と併用することで、 str内の文字を反復処理することができます。

source: With only `iterate` definition, the Squares type is already pretty powerful.
ja: 'reiterate''定義では、Squaresタイプはすでにかなり強力です。

source: With this method definition what was previously a `MethodError` now successfully creates a point of type Point{Float64}:
ja: この方法の定義では、以前は'MethodError''であった。 は、ポイント{Float64}のポイントを作成します。<x/>:

source: With this method definition, the Point constructor promotes its arguments the same way that numeric operators like `+` do, and works for all kinds of real numbers:
ja: このメソッド定義では、ポイントコンストラクタは、引数を同じ方法でプロモートします。 `+`のような数値演算子は、すべての種類の実数に対して動作します。

source: With this syntax, iterables may still refer to outer loop variables; e.g. for i = 1:n, j = 1:i
ja: この構文では、iterablesは依然として外部ループ変数を参照することができます。例えば、i=1:n、j=1:iのようなです。

source: Without any explicitly provided inner constructors, the declaration of the composite type Point{T<:Real}
ja: 明示的に提供された内部コンストラクタがない場合、複合型ポイント{T<:Real}の宣言

source: Without any specifier, the platform-default C calling convention is used.
ja: 指定されていない場合は、プラットフォームデフォルトのC呼び出し規約が使用されます。

source: Without parentheses, the expression f refers to the function object, and can be passed around like any value:
ja: 括弧をつけない式fは、関数オブジェクトを表し、他の値と同じように受け渡しができます。

source: Without the break keyword, the above while loop would never terminate on its own, and the for loop would iterate up to 1000.
ja: breakキーワードがなければ、上記のwhileループは決して自身で終了することはなく、forループは1000まで繰り返されます。

source: Word separation can be indicated by underscores ('_'), but use of underscores is discouraged unless the name would be hard to read otherwise.
ja: 単語の区切りはアンダースコア（'_'）で表すことができますが、変数名が読みにくい場合の除き使用は推奨されていません。

source: Working with Broadcasted objects
ja: ブロードキャストされたオブジェクトの操作

source: You (or someone else) can also provide additional outer constructor methods at any later point, but once a type is declared, there is no way to add more inner constructor methods.
ja: また、別の時点で外部コンストラクタのメソッドを追加することもできます。 タイプが宣言されると、インナー・コンストラクタ・メソッドを追加する方法はありません。

source: You are responsible for implementing the broadcasting shape rules yourself, but this may be helpful in limited situations.
ja: あなたは 放送の形状ルールは自分自身であるが、これは限られた状況では役に立つかもしれない。

source: You can also combine dot operations with function chaining using `|>`, as in this example:
ja: また、次の例のように、ドット操作を`を使って関数連鎖と組み合わせることもできます。

source: You can also extract a substring using range indexing:
ja: 範囲のインデックスを使用することで、文字列の一部分を抽出できます。:

source: You can also find the numerical precedence for any given operator via the built-in function Base.operator_precedence, where higher numbers take precedence:
ja: また、組み込み関数Base.operator_precedenceを使用して、任意の演算子の優先順位を検索することもできます。ここでは、より高い数値が優先されます。

source: You can also return multiple values via an explicit usage of the return keyword:
ja: また、returnキーワードを明示的に使用して、複数の値を返すこともできます。

source: You can convert a Char to its integer value, i.e. code point, easily:
ja: Char を整数値（コードポイント）へと簡単に変換することができます。:q

source: You can convert an integer value back to a Char just as easily:
ja: また、整数値を簡単に Char へと変換し直すこともできます。:

source: You can do comparisons and a limited amount of arithmetic with Char values:
ja: Char値を使用して限定的な算術演算や Char 同士の比較を行うことができます。:

source: You can easily convert a Char to its integer value, i.e. code point:
ja: Char を整数値、すなわち、コードポイントへ簡単に変換できます。:q

source: You can easily experiment in the same way with the associativity and precedence of various combinations of && and || operators.
ja: さまざまな組み合わせのアソシエティビティと優先順位によって、同じ方法で簡単に実験することができます。 &&および演算子のことです。

source: You can easily see which methods exist for a function by entering the function object itself in an interactive session:
ja: 対話セッションで関数オブジェクト自体を入力すると、関数にどんなメソッドが存在するかを簡単に確認できます。

source: You can easily sort in reverse order as well:
ja: 逆順でも簡単にソートできます。

source: You can get a near approximation of a union if you know, a priori, the field that will have the greatest size (potentially including padding).
ja: の近似を知ることができるのなら、それは<x x/>の近似値を得ることができる。 最大サイズ(パディングを含む可能性があります)。

source: You can input any Unicode character in single quotes using \u followed by up to four hexadecimal digits or \U followed by up to eight hexadecimal digits (the longest valid value only requires six):
ja: シングルクオーテンションで囲まれたエリアの中では、\u に続けて最大4桁の16進数を入力するか、\Uに続けて最大8桁の16進数（6桁から有効）を入力することで、 Unicode文字を入力することができます。:

source: You can lexicographically compare strings using the standard comparison operators:
ja: 文字列を標準比較演算子を使用して比較できます。:

source: You can pass incomplete objects to other functions from inner constructors to delegate their completion:
ja: 不完全なオブジェクトを内部コンストラクタから他の関数に渡して、その完了を委任することができます。

source: You can perform all the standard arithmetic operations with complex numbers:
ja: 複雑な数値を使用して、すべての標準算術演算を実行できます。

source: You can perform arithmetic and other operations with `end`, just like a normal value:
ja: 通常の値と同様に、`end`を用いて、算術演算やその他の処理を行うことができます。

source: You can perform arithmetic and other operations with end, just like a normal value:
ja: end は通常の値と同様に、算術演算やその他の処理を行うことができます。

source: You can push an environment including development tools onto the stack and they will be available from the REPL and scripts but not from inside packages.
ja: 開発ツールを含む環境をスタックにプッシュすることができ、REPLとスクリプトから入手できますが、内部パッケージからは利用できません。

source: You can search for the index of a particular character using the `search()` function:
ja: `search()` 関数を使用して特定の文字のインデックスを検索することができます。:

source: You can start the search for a character at a given offset by providing a third argument:
ja: 3番目の引数を指定することで指定されたオフセットで文字の検索をすることができます。:

source: You can use the `contains()` function to check if a substring is contained in a string:
ja: `contains()` 関数を使用して、文字列に部分文字列が含まれているか確認することができます。:

source: You can't import the type names into Main and then expect to be able to redefine them there, but you can use the module name to resolve the scope.
ja: メインにはタイプ名をインポートできないので、次のように入力することはできません。 で再定義することができますが、このモジュール名を使用してスコープを解決することができます。

source: You could also add a zero-argument Foo constructor method that supplies default values for both of the bar and baz fields:
ja: また、0つの引数Fooコンストラクタメソッドを追加して、両方のデフォルト値を指定することもできます。 barおよびbazの各フィールドのうち、以下のようになります。

source: You do not need to write binary BroadcastStyle
ja: バイナリのBroadcastStyleを書く必要はありません。

source: You may define your own exceptions in the following way:
ja: 次の方法で独自の例外を定義することができます。

source: You may want to try this for yourself to see how it works.
ja: これがどのように動作するかを見るために自身で試してみたいと思うかもしれません。

source: You might want broadcasting to preserve the char "metadata." First we define
ja: char"メタデータを保存するためにブロードキャストを行うことができます。まず、次のように定義します。

source: You must be careful in this case to ensure that the object was always visible to the garbage collector (pointers do not count, but the new reference does) to ensure the memory is not prematurely freed.
ja: あなたは この場合は、オブジェクトが常にガーベッジ・コレクターに表示されるように注意する必要があります。 メモリが初期解放されていないことを確認するために、この新しい参照はカウントしませんが、新しい参照は必要ありません。

source: You must ensure that this return object is kept alive until all uses of it are done.
ja: この戻りオブジェクトは、すべての使用が完了するまで生きていることを確認する必要があります。

source: You refer to the Foo symbols by their qualified names Foo.bar etc.
ja: ここでは Foo記号は、それらの修飾名Foo.barなどで表されます。

source: You should also specialize `similar`
ja: また、`similar`を特化する必要があります。

source: You'll either need a new interactive session instance or a different variable name to test this:
ja: 新しい対話型セッション・インスタンスまたは別の変数が必要です。 テストする名前:

source: `@cfunction` requires three arguments: the Julia function (mycompare), the return type (Cint), and a literal tuple of the input argument types, in this case to sort an array of Cdouble
ja: `@cfunctionは3つの引数を必要とします:Julia関数(ミコンパレ)、戻り値のタイプ (Cint)と、入力引数型のリテラルタプルで、この場合はCdoubleの配列をソートします。

source: `Base.cconvert` normally just calls `convert`, but can be defined to return an arbitrary new object more appropriate for passing to C. This should be used to perform all allocations of memory that will be accessed by the C code.
ja: 'Base.チコンベルト'は通常、'convert`を呼び出しますが、次のように定義することができます。 任意の新しいオブジェクトを渡すには、任意の新しいオブジェクトが必要です。 これは、Cコードによってアクセスされるメモリーのすべての割り当てを実行するために使用される必要があります。

source: `Base.cconvert` normally just calls `convert`, but can be defined to return an arbitrary new object more appropriate for passing to C. This should be used to perform all allocations of memory that will be accessed by the C code. For example, this is used to convert an Array of objects (e.g. strings) to an array of pointers.
ja: 'Base.チコンベルト'は通常、'convert`を呼び出しますが、次のように定義することができます。 任意の新しいオブジェクトを渡すには、任意の新しいオブジェクトが必要です。 これは、Cコードによってアクセスされるメモリーのすべての割り当てを実行するために使用される必要があります。 たとえば、これは、オブジェクトの配列をポインタの配列に変換するために使用されます。
